cases/chpt4-forces-MarP/system/blockMeshDict
  /*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-2;

vertices
(
    (0 0 0)
    (2.9958 0.1307 0)
    (2.9958 0.1307 1)
    (0 0 1)
    (2.9958 -0.1307 0)
    (2.9958 -0.1307 1)

);

blocks
(
    hex (0 4 1 0 3 5 2 3) (75 1 75) simpleGrading (5 1 1)
);

edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (3 5 2 3)
        );
    }
    btm
    {
        type wall;
        faces
        (
            (0 4 1 0)
        );
    }
    wallTube
    {
        type wall;
        faces
        (
            (1 4 5 2)
        );
    }
    front
    {
        type wedge;
        faces
        (
           (0 1 2 3)
        );
    }
    back
    {
        type wedge;
        faces
        (
           (0 3 5 4)
        );
    }
    axis
    {
      type empty;
      faces
      (
         (0 3 3 0)
      );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
