cases/chpt4-forces-MarP/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    top
    {
        type            patch;
        nFaces          75;
        startFace       11100;
    }
    btm
    {
        type            wall;
        inGroups        1(wall);
        nFaces          75;
        startFace       11175;
    }
    wallTube
    {
        type            wall;
        inGroups        1(wall);
        nFaces          75;
        startFace       11250;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          5625;
        startFace       11325;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          5625;
        startFace       16950;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       22575;
    }
)

// ************************************************************************* //
