cases/chpt4-forces-MarP/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    top
    { 
        type            groovyBC;
        value           uniform 300;
        valueFraction   uniform 1;
        valueExpression "Tinf_Met";
        gradientExpression "0";
        fractionExpression "f_Met";
        evaluateDuringConstruction 0;
        cyclicSlave     0;
        variables       
6
(
"k_Met=16.3;"
"Tinf_Met=300;"
//"alpha_Met=10;"
"sig_rad=5.6e-8;"
"emmi=1;"
"alpha_Met=25+(sig_rad*emmi*(pow(T,2)+pow(Tinf_Met,2))*(T+Tinf_Met));"
"f_Met=1/(1+(k_Met/(alpha_Met*mag(delta()))));"
)
;
        timelines       (
);
        lookuptables    (
);
        lookuptables2D  (
);    }
    btm
    { 
        type            groovyBC;
        value           uniform 300;
        valueFraction   uniform 1;
        valueExpression "Tinf_Met";
        gradientExpression "0";
        fractionExpression "f_Met";
        evaluateDuringConstruction 0;
        cyclicSlave     0;
        variables       
6
(
"k_Met=16.3;"
"Tinf_Met=300;"
//"alpha_Met=10;"
"sig_rad=5.6e-8;"
"emmi=1;"
"alpha_Met=25+(sig_rad*emmi*(pow(T,2)+pow(Tinf_Met,2))*(T+Tinf_Met));"
"f_Met=1/(1+(k_Met/(alpha_Met*mag(delta()))));"
)
;
        timelines       (
);
        lookuptables    (
);
        lookuptables2D  (
);    }
    back
    {
        type            wedge;
    }
    wallTube
    {
        type 			fixedValue;
        value 			uniform 300;
    }
    front
    {
        type            wedge;
    }
    sym
    {
        type            symmetry;
    }
}           

// ************************************************************************* //
